<template>
  <div>
    <section class="questions">
      <h3>คำถามประจำสาขา <span class="themeText">Web {{ majorName }}</span></h3>
      ให้เลือกทำ 1 ข้อ ระหว่าง<br />
      <h4>1. ช่วยสรุปรายการ "เดินหน้าประเทศไทย" ให้ดูน่าสนใจ</h4>
      <p>สมมติว่าคุณเป็นทีมงานโซเชียลมีเดียของรัฐบาล มีหน้าที่ต้องสื่อสารผลงานต่างๆ ให้ประชาชนรับรู้ผ่านช่องทางสื่อออนไลน์ หนึ่งในงานที่คุณรับผิดชอบคือการนำเสนอเนื้อหาจากรายการ "เดินหน้าประเทศไทย" ซึ่งถ้าเอาคลิปทั้งรายการมาแชร์ก็คงไม่น่าสนใจ คุณจึงต้องสรุปเนื้อหารายการให้ดูน่าสนใจสำหรับชาวโซเชียลให้ได้<br>
  ให้คุณเลือกรายการ "เดินหน้าประเทศไทย" หรือ "เดินหน้าประเทศไทย วัยทีน" ตอนใดก็ได้มาหนึ่งตอน ทำสรุปเนื้อหาของรายการเป็นสื่อรูปแบบใดก็ได้ เช่น ข้อความ รูปภาพ อินโฟกราฟิก คลิปสั้น ฯลฯ แล้วเลือกช่องทางโซเชียลมีเดียที่จะใช้นำเสนอ เช่น Facebook, Twitter, YouTube, Instagram, Pantip ที่เหมาะกับเนื้อหาที่คุณทำมา</p>
      <h4>2. หลังจากไม่ได้เลือกตั้งมา 7 ปี และมีคนรุ่นใหม่จำนวนมากที่ยังไม่เคยเลือกตั้งมาก่อน จงทำ Content ที่อธิบายระบบการเลือกตั้งแบบใหม่ ที่แตกต่างจากเดิม ทั้งการเลือกส.ส.,Party List, และที่มาของการได้นายกรัฐมนตรี</h4>
    </section>
    <h3>รายชื่อผู้ผ่านการคัดเลือกเข้ารอบสัมภาษณ์ สาขา <span class="themeText">Web {{ majorName }}</span></h3>
  </div>
</template>
<script>
export default {
  props: {
    majors: { type: Object, default: () => { return {} } }
  },
  computed: {
    major () {
      return this.$route.params.major
    },
    majorName () {
      return this.majors[this.major][0]
    },
    majorTheme () {
      return this.majors[this.major][1]
    }
  }
}
</script>
<style scoped lang="scss">
section {
  margin-top: 0;
  margin-bottom: 44px;
}
</style>
