<template>
  <section class="container">
    <SectionHead title="What is YWC" />
    <p>
      เมื่อเทคโนโลยีที่เปลี่ยนไปได้เข้ามาสร้างการเปลี่ยนแปลง จนทำให้หลายๆ สิ่งที่เคยมีอยู่ในอดีต ถูกแย่งชิงบทบาทจนแทบจะหายไป ในฐานะของค่ายสร้างเว็บหนึ่งเดียวของไทย เรากำลังตามหาคนทำเว็บสายเลือดใหม่ ที่พร้อมตะลุยไปในโลกดิจิตัลและ Disrupt ทุกความเคลื่อนไหวด้วยเทคโนโลยีไปพร้อมกับพวกเรา และเพื่อนๆ จากหลากหลายสาขา ไม่ว่าจะเป็น Content, Design, Marketing และ Programming และยังได้ใกล้ชิดกูรูจากวงการเว็บไทย ที่จะมาแนะแนวทาง พร้อมให้คำวิจารณ์ที่ไม่เคยมีใครได้สัมผัสมาก่อน หากคุณคือคนรุ่นใหม่ ที่อยากจะลุกขึ้นมาสร้างนวัตกรรมใหม่ที่จะเปลี่ยนแปลงโลก นี่คือโอกาสของคุณ! กับ Young Webmaster Camp ครั้งที่ 17 “Social Change, Arrange The World” ค่ายสร้างเว็บไซต์ระดับอุดมศึกษาที่ใหญ่ที่สุด ที่ปีนี้จะมาชวนนักศึกษามหาวิทยาลัยจากทั่วประเทศมาฝึกสกิลของตัวเอง พร้อม ๆ กับสร้างเว็บไซต์ที่จะช่วยแก้ไขปัญหาต่าง ๆ ในสังคมและทำให้สังคมของเราน่าอยู่ขึ้น
    </p>
  </section>
</template>
<style scoped>
@media (max-width:768px) {
  p {
    font-size: 16px;
  }
}
</style>
<script>
import SectionHead from '~/components/SectionHead.vue'
export default {
  components: {
    SectionHead
  }
}
</script>
