export const majors = {
  content: ['Content', 'green'],
  design: ['Design', 'yellow'],
  marketing: ['Marketing', 'pink'], 
  programming: ['Programming', 'blue']
}

export const INTERVIEW_QUESTIONS = {
  content: ` ให้เลือกทำ 1 ข้อ ระหว่าง<br />
      <h4>1. ช่วยสรุปรายการ "เดินหน้าประเทศไทย" ให้ดูน่าสนใจ</h4>
      <p>สมมติว่าคุณเป็นทีมงานโซเชียลมีเดียของรัฐบาล มีหน้าที่ต้องสื่อสารผลงานต่างๆ ให้ประชาชนรับรู้ผ่านช่องทางสื่อออนไลน์ หนึ่งในงานที่คุณรับผิดชอบคือการนำเสนอเนื้อหาจากรายการ "เดินหน้าประเทศไทย" ซึ่งถ้าเอาคลิปทั้งรายการมาแชร์ก็คงไม่น่าสนใจ คุณจึงต้องสรุปเนื้อหารายการให้ดูน่าสนใจสำหรับชาวโซเชียลให้ได้<br>
  ให้คุณเลือกรายการ "เดินหน้าประเทศไทย" หรือ "เดินหน้าประเทศไทย วัยทีน" ตอนใดก็ได้มาหนึ่งตอน ทำสรุปเนื้อหาของรายการเป็นสื่อรูปแบบใดก็ได้ เช่น ข้อความ รูปภาพ อินโฟกราฟิก คลิปสั้น ฯลฯ แล้วเลือกช่องทางโซเชียลมีเดียที่จะใช้นำเสนอ เช่น Facebook, Twitter, YouTube, Instagram, Pantip ที่เหมาะกับเนื้อหาที่คุณทำมา</p>
      <h4>2. หลังจากไม่ได้เลือกตั้งมา 7 ปี และมีคนรุ่นใหม่จำนวนมากที่ยังไม่เคยเลือกตั้งมาก่อน จงทำ Content ที่อธิบายระบบการเลือกตั้งแบบใหม่ ที่แตกต่างจากเดิม ทั้งการเลือกส.ส.,Party List, และที่มาของการได้นายกรัฐมนตรี</h4>
      `,
  design: ``,
  marketing: ``,
  programming: ``
}
